/**
    Задача "Flatten".
    Напишите функцию flatten(arr), которая принимает массив, содержащий вложенные массивы, и возвращает новый массив,
    в котором все элементы исходного массива и его вложенных массивов расположены на одном уровне.
    Например, flatten([1, [2, 3], [4, [5, 6]]]) должна вернуть [1, 2, 3, 4, 5, 6].

    Использовать метод flat() в решении нельзя!
* */
function flatten(arr) {
    const result = [];

    arr.forEach((item) => {
        if (Array.isArray(item)) {
            //массив, содержащий вложенные массивы, и возвращает новый массив
            result.push(...flatten(item));
        } else {
            result.push(item);
        }
    });
    return result;
}

console.log(flatten([1, [2, 3], [4, [5, 6]]]));