/**
 * Функция, которая принимает на вход два массива чисел и возвращает новый массив, содержащий только элементы, которые есть в обоих массивах.
 * @param {number[]} arr1 - первый входной массив чисел
 * @param {number[]} arr2 - второй входной массив чисел
 * @return {number[]} - массив, содержащий только элементы, которые есть в обоих массивах
 */
function intersect(arr1, arr2) {
    // Сохраняем элементы первого массива которые находятся во втором.
    // filter перебирает и СОздает новый массив только для тех элементов для которых вернулось true
    // includes проверяет и возвращает true или false
    const Elements = arr1.filter((item) => {
        return arr2.includes(item);
    });
    return [...new Set(Elements)];
    // set Хранит только уникальные значения, убираем возможные повторы.
}

console.log(intersect([1, 2, 3], [2, 3, 4]));

console.log(intersect([1, 2], [3, 4]));
